## Reading Data From Different Sources

In [52]:
import pandas as pd
from io import StringIO
Data = '{"employee_name":"harshini","email": "harshini@gmail.com","job_profile": [{"title1":"Team Lead","title2":"Sr. Developer"}]}'
df = pd.read_json(StringIO(Data))

In [53]:
df

,employee_name,email,job_profile
0,harshini,harshini@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [54]:
df.to_json()

'{"employee_name":{"0":"harshini"},"email":{"0":"harshini@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [55]:
df.to_json(orient='index')

'{"0":{"employee_name":"harshini","email":"harshini@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [56]:
df.to_json(orient='records')

'[{"employee_name":"harshini","email":"harshini@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [57]:
!pip install html5lib
!pip install beautifulsoup4
!pip install lxml

17215.90s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Requirement already satisfied: html5lib in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (from html5lib) (0.5.1)

17221.43s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Requirement already satisfied: beautifulsoup4 in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (4.13.4)
Requirement already satisfied: soupsieve>1.2 in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (from beautifulsoup4) (2.7)
Requirement already satisfied: typing-extensions>=4.0.0 in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (from beautifulsoup4) (4.14.0)

17226.95s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Requirement already satisfied: lxml in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (6.0.0)

In [58]:
df = pd.read_csv("wine.csv",header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1,7.4,0.7,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
2,7.8,0.88,0.0,2.6,0.098,25.0,67.0,0.9968,3.2,0.68,9.8,5
3,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.997,3.26,0.65,9.8,5
4,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.998,3.16,0.58,9.8,6

In [59]:
url = "https://www.fdic.gov/bank-failures/failed-bank-list"
df = pd.read_html(url) 
df

[                               Bank Name           City         State   Cert  \
 0           The Santa Anna National Bank     Santa Anna         Texas   5520
 1                   Pulaski Savings Bank        Chicago      Illinois  28611
 2     The First National Bank of Lindsay        Lindsay      Oklahoma   4134
 3  Republic First Bank dba Republic Bank   Philadelphia  Pennsylvania  27332
 4                          Citizens Bank       Sac City          Iowa   8758
 5               Heartland Tri-State Bank        Elkhart        Kansas  25851
 6                    First Republic Bank  San Francisco    California  59017
 7                         Signature Bank       New York      New York  57053
 8                    Silicon Valley Bank    Santa Clara    California  24735
 9                      Almena State Bank         Almena        Kansas  15426

                  Acquiring Institution      Closing Date  Fund  Sort ascending
 0            Coleman County State Bank     June 27, 2025                 10549
 1                      Millennium Bank  January 17, 2025                 10548
 2   First Bank & Trust Co., Duncan, OK  October 18, 2024                 10547
 3    Fulton Bank, National Association    April 26, 2024                 10546
 4            Iowa Trust & Savings Bank  November 3, 2023                 10545
 5               Dream First Bank, N.A.     July 28, 2023                 10544
 6            JPMorgan Chase Bank, N.A.       May 1, 2023                 10543
 7                  Flagstar Bank, N.A.    March 12, 2023                 10540
 8  First Citizens Bank & Trust Company    March 10, 2023                 10539
 9                          Equity Bank  October 23, 2020                 10538  ]

In [60]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538

In [61]:
url = "https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url,match="Country",header = 0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [62]:
!pip install openpyxl

17233.13s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Requirement already satisfied: openpyxl in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Users/venkateshreddyningam/Desktop/Data analytics/venv/lib/python3.13/site-packages (from openpyxl) (2.0.0)

In [63]:
data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 28]
}
df = pd.DataFrame(data)

# Save as Excel (.xlsx) - This creates a valid Excel file
df.to_excel('sample_data.xlsx', index=False, engine='openpyxl')

In [64]:
df_excel = pd.read_excel('sample_data.xlsx')

In [66]:
df_excel.to_pickle('df_excel')

In [67]:
pd.read_pickle('df_excel')

    Name  Age
0   John   25
1  Alice   30
2    Bob   28